/**
 * 随机名称生成器 
 */

// 前半部分
const str1List = [
    // 动物  
    '老虎', '狮子', '豹子', '家猫', '豹猫',
    '狗狗', '灰狼', '狐狸', '豺狼',
    '棕熊', '熊猫', '棕熊', '北极熊',
    '猴子', '猩猩', '长臂猿',
    '田鼠', '松鼠', '兔子', '豚鼠',
    '水牛', '绵羊', '梅花鹿', '河马',
    '骏马', '斑马', '犀牛',
    '麻雀', '喜鹊', '燕子', '知更鸟',
    '鸽子', '斑鸠', '鹬鸠',
    '白鹤', '白鹳', '苍鹭',
    '游隼', '金雕',
    '天鹅', '大雁',
    '鹦鹉', '鸵鸟', '鸸鹋',
    '乌龟', '海龟', '甲鱼',
    '蜥蜴', '壁虎', '巨蜥', '鳄鱼',
    '青蛙', '蟾蜍',
    '蝾螈', '大鲵',
    '鲨鱼', '鳐鱼', '魟鱼',
    '金鱼', '鲤鱼', '带鱼',
    '鲈鱼', '鲑鱼', '鳕鱼',
    '蜜蜂', '黄蜂', '蚂蚁',
    '蝴蝶', '飞蛾',
    '蟋蟀', '蚱蜢',
    '甲虫', '瓢虫', '天牛',
    '蜘蛛', '螃蟹', '大龙虾',
    '蜗牛', '章鱼', '乌贼',

    // 水果
    "苹果", "香蕉", "橙子", "葡萄", "草莓", "蓝莓", "桃子", "柠檬", "西瓜", "菠萝",
    "芒果", "猕猴桃", "樱桃", "李子", "石榴", "火龙果", "哈密瓜", "柚子", "木瓜",
    "柿子", "荔枝", "橄榄", "榴莲", "山楂", "椰子", "青梅", "杨梅", "枣子", "番石榴",
    "杏子", "无花果", "桑葚", "枇杷", "桔子", "山楂果", "蛇果", "蜜柚", "百香果",
    "番荔枝", "莲雾", "牛油果", "释迦果", "黑布林", "人心果", "蒲桃", "刺梨",
    "菠萝蜜", "灯笼果", "八月瓜",

    // 植物
    "玫瑰", "郁金香", "向日葵", "菊花", "兰花", "竹子", "松树", "柳树",
    "樱花", "百合", "牡丹", "芦荟", "薄荷", "薰衣草", "桂花", "银杏", "仙人掌",
    "仙人掌", "荷花", "牵牛花", "鸢尾花", "蝴蝶兰", "仙客来", "蒲公英",
    "紫罗兰", "君子兰", "茉莉花", "龟背竹", "吊兰", "猪笼草", "凤仙花", "满天星",
    "石斛兰", "蟹爪兰", "菖蒲", "丁香", "美人蕉", "茑萝", "海棠",
    "金丝桃", "荇菜", "虞美人", "观音莲", "鹤望兰", "铃兰", "紫藤", "猪笼草"
];

// 后半部分
const str2List = [
    // 建筑  
    '公寓', '别墅', '宿舍', '民居', '别墅', '独立屋', '公寓',
    '幼儿园', '小学', '中学', '高中', '大学', '学校', '图书馆', '科技楼',
    '办公楼', '写字楼', '大楼', '总部', '中心',
    '商场', '超市', '便利店', '餐馆', '咖啡厅', '酒吧', '电影院', '书店',
    '医院', '诊所', '康复中心', '疗养院',
    '体育馆', '游泳馆', '健身', '运动场', '篮球场', '足球场',
    '工厂', '车间', '仓库', '物流', '研发', '基地',
    '温室', '养殖场', '农机库', '加工厂', '仓库',
    '公园', '动物园', '植物园', '景观桥', '花坛', '喷泉',
    '纪念碑', '纪念馆', '博物馆', '广场',
    '大楼', '电台', '电视台',
    '航站楼', '火车站', '汽车站', '地铁站', '公交站', '桥梁', '隧道',
    '游乐园', '乐园', '球场', '球馆',
    '社区', '物业', '游泳池', '网球场',

    // 电器
    "电冰箱", "微波炉", "电饭煲", "电烤箱", "电磁炉", "榨汁机", "豆浆机", "咖啡机", "洗碗机", "油烟机", "电饭锅", "电压力锅", "水壶", "消毒柜", "面包机",
    "洗衣机", "干衣机", "吸尘器", "机器人", "电动拖把", "净化器", "除湿机", "加湿器", "擦窗机", "拖把",
    "空调", "取暖器", "电暖气", "加湿器", "除湿器", "净化器", "空调扇",
    "电视机", "音响", "播放器", "游戏机", "投影仪", "音响", "MP3",
    "剃须刀", "牙刷", "电吹风", "卷发棒", "直发器", "按摩器", "洗脸仪", "美容仪",
    "电脑", "打印机", "复印机", "扫描仪", "传真机", "投影仪", "碎纸机", "路由器", "交换机",
    "摄像头", "门禁", "烟雾器", "警报器", "门铃", "探测器",
    "手机", "电话", "路由器", "电视盒子", "摄像头", "耳机",
    "电动车", "充电器", "净水器", "电熨斗", "窗帘", "灯泡", "插座", "音箱", "门锁", "摄像头", "体重秤", "晾衣架", "按摩椅"

];

/**
 * 随机生成一个玩家名字
 * @returns {string} 玩家名字 
 */
export const randomUsername = function () {
    let str1 = str1List[Math.floor(Math.random() * str1List.length)];
    let str2 = str2List[Math.floor(Math.random() * str2List.length)];
    return str1 + str2;
}
